local announce = {
    {
        template = 1,
        args = { 'auto', 'در صورتی که ریپورت دهید و مدرک کافی نداشته باشید، یا نتوانید ادعای خود را ثابت کنید، یا حق با طرف مقابل باشد، به دلیل وقفه در روند آرپی، تلف کردن وقت دیگران و ادمین، با شما برخورد خواهد شد '}
    },
    {
        template = 1,
        args = { 'auto', 'اگر در روند آرپی هستید و ریپورت دادید، تا تمام نشدن روند آرپی، به ریپورت شما رسیدگی نخواهد شد'}
    },
    {
        template = 1,
        args = { 'auto', 'زمانی که پیام ریست سرور را می‌بینید، از آرپی‌های طولانی پرهیز کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'حتماً از روند آرپی خود رکورد داشته باشید که در صورت بروز مشکل، بتوانید ادعای خود را ثابت کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'استفاده الفاظ رکیک، تبلیغ، ایموجی و کدهای رنگی و... ، در اسم استیم و اسم آی‌سی ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'اگر در یک آرپی، نیاز به ریپورت دادن باشد، از هر گروه فقط یک نفر می‌تواند ریپورت دهد، در غیراینصورت با شما برخورد خواهد شد'}
    },
    {
        template = 1,
        args = { 'auto', 'در صورت مشاهده هر گونه باگ و گلیچ در بازی، موظفید آن را به ادمین گزارش دهید'}
    },
    {
        template = 1,
        args = { 'auto', 'در صورتی که از هر گونه باگ یا گلیچ استفاده کنید ، اکانت شما ریست و بن‌ خواهد ‌شد'}
    },
    {
        template = 1,
        args = { 'auto', 'به دلیل زیاد بودن تعداد ریپورت و به خاطر اینکه رسیدگی به هر ریپورت زمان‌بر است، لطفاً پس از ریپورت صبور باشید. در صورت عدم رسیدگی به دیسکورد مراجعه کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'هر گونه فحاشی ناموسی و توهین جنسی در چت و ویس ممنوع است و شدیدا برخورد خواهد شد'}
    },
    {
        template = 1,
        args = { 'auto', 'پس از کشتن یا مجروح کردن کسی، استفاده از هرگونه کلمات رکیک، تحریک‌آمیز، رجزخوانی ، تمسخر بر سر جنازه شخص ممنوع می‌باشد'}
    },
    {
        template = 1,
        args = { 'auto', 'در صورتی که مدیک در حال مداوای شماست، شما موظفید آرپی مدیک را دنبال کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'هر گونه توهین و بی‌احترامی به شغل‌های دولتی در زمان آن‌دیوتی، ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'مخلوط کردن هرگونه اطلاعات خارج از روند رول پلی در سناریوی رول پلی متاگیمینگ نام دارد و خلاف قوانین است'}
    },
    {
        template = 1,
        args = { 'auto', 'اعمال غیر طبیعی که در واقعیت، انجام آن برای یک انسان غیر ممکن است یا عقلانی نیست، پاورگیمینگ نام دارد و خلاف قوانین است'}
    },
    {
        template = 1,
        args = { 'auto', 'رم کردن با ماشین‌های اسپرت پاورگیمینگ محسوب می‌شود'}
    },
    {
        template = 1,
        args = { 'auto', 'زمانی که زخمی شده‌اید و مدیک شما را سرپایی مداوا ‌کند، تا 5 دقیقه حق انجام کارهایی مانند پریدن، دویدن، فایت‌دادن و... را ندارید'}
    },
    {
        template = 1,
        args = { 'auto', 'زمانی که شما پیاده و یا سوار موتور هستید و اسلحه یا تیزر از نزدیک (بدون حفاظ) به سمت شما ایم گرفته شده تا زمانی که اسلحه یا تیزر به سمت شما است، حق فرار یا در آوردن اسلحه یا در آوردن گوشی برای کمک گرفتن از کسی را ندارید'}
    },
    {
        template = 1,
        args = { 'auto', 'کی.او.اس به معنای اجازه داشتن، برای اقدام به قتل فردی، برای انتقام گرفتن از آن شخص'}
    },
    {
        template = 1,
        args = { 'auto', 'شما نباید برای ک.او.اس گرفتن، شخصی را تحریک کنید یا موقعیتی بوجود آورید که شخصی ناخواسته به دارایی شما آسیب برساند. (مثال: برای ک.او.اس گرفتن از شخصی، جلوی ماشینش ترمز کنید، بی دلیل به او مشت بزنید ، بی دلیل ماشینش را پنچر کنید و...)'}
    },
    {
        template = 1,
        args = { 'auto', 'درگیری لفظی بین دو نفر، ک.او.اس نمی دهد'}
    },
    {
        template = 1,
        args = { 'auto', 'شما به بهانه جرایم راهنمایی و رانندگی و یا حمل اسلحه غیر مجاز نباید به نیروهای انتظامی شلیک کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'نباید به فرد یا اموال شخصی، بدون داشتن دلیل محکم (ک.او.اس) آسیب برسانید'}
    },
    {
        template = 1,
        args = { 'auto', 'اگر شما و دوستانتان در منطقه‌ای درگیر شدید ، شما موظفید پس از اتمام فایت سریعاً محل را ترک کنید. در صورتی که در منطقه بمانید و منجر به بزرگتر شدن فایت شود با شما برخورد خواهد شد'}
    },
    {
        template = 1,
        args = { 'auto', 'اگر دو گروه با یکدیگر درگیر باشند، شما به هیچ عنوان نباید وارد آن درگیری شوید'}
    },
    {
        template = 1,
        args = { 'auto', 'اگر گروهی به قصد رابری، در محل رابری باشد و شما از آن گروه کی.او.اس داشته باشید، نباید با آنها درگیر شوید'}
    },
    {
        template = 1,
        args = { 'auto', 'درگیری و فایت‌های بزرگ، در دایره سبز شهر ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'اگر شما غیرعمد با شخصی تصادف کردید، موظفید برای بررسی وضعیت مسدوم به محل بازگردید'}
    },
    {
        template = 1,
        args = { 'auto', 'وقتی سوار ماشین هستید، نباید برای متوقف کردن موتورسوار، با او تصادف یا رم کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'در خفت‌گیری شما نباید به شخص تیر خلاص بزنید، حتی اگر به دستورات شما عمل نکند'}
    },
    {
        template = 1,
        args = { 'auto', 'نباید در رابری‌ها یا درگیری خیابانی، به پلیس تیر خلاص بزنید'}
    },
    {
        template = 1,
        args = { 'auto', 'کسانی که در یک سناریوی رول پلی تایم اوت می‌شوند، حداکثر تا 10 دقیقه باید برای ادامه روند رول پلی، به بازی برگشته و ادامه رول پلی را انجام دهند'}
    },
    {
        template = 1,
        args = { 'auto', 'کشتن و زخمی کردن دوستان خود، برای تفریح و سرگرمی ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'شما با لباس، ماشین و وسایل دولتی نمی‌توانید کار خلافی انجام دهید'}
    },
    {
        template = 1,
        args = { 'auto', 'ان‌سی‌زد مناطقی هستند که تحت شدیدترین تدابیر امنیتی می‌باشند و مرتکب شدن هر گونه جرمی در آن ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'در مناطق ان‌سی‌زد حتی برای دفاع از خود هم، نباید با کسی درگیر شوید'}
    },
    {
        template = 1,
        args = { 'auto', 'در مناطق ان‌سی‌زد ، معامله‌های غیر مجاز (اسلحه، مواد و...) ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'در مناطق ان‌سی‌زد ، دزدی (ماشین، وسایل داخل صندوق ماشین و خفت‌گیری) ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'سیف‌زون مناطقی‌امنی هستند که بدون دلیل و داشتن مدرک معتبر درگیری در این مناطق، ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'در مناطق سیف‌زون دزدی (ماشین، وسایل داخل صندوق ماشین، خفت‌گیری و...) ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'نباید در ان‌سی‌زد کسی را دستبند بزنید'}
    },
    {
        template = 1,
        args = { 'auto', 'برای دستبند زدن، باید دست‌های طرف مقابل بالا باشد، یا دوست یا همکار شما با تفنگ یا شوکر به سمتش نشانه گرفته باشد'}
    },
    {
        template = 1,
        args = { 'auto', 'نباید در مناطق ان‌سی‌زد کسی را سرچ‌کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'اگر، طبق قوانین سرچ، مجاز به سرچ کسی هستید، باید از اتمام درگیری مطمئن شوید'}
    },
    {
        template = 1,
        args = { 'auto', 'در رابری‌ها اولویت با تیمی است، که با تعداد نفرات کامل، وارد منطقه شود'}
    },
    {
        template = 1,
        args = { 'auto', 'در محل رابری اگر با گروهی درگیر شدید، حق شروع‌کردن رابری را ندارید'}
    },
    {
        template = 1,
        args = { 'auto', 'کمپ کردن اطراف منطقه رابری، جهت خفت‌گیری و اجرای کی‌او‌اس از رابرها، ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'رابرها اجازه ندارند، وسایل نقلیه نیروهای انتظامی را پنچر کند'}
    },
    {
        template = 1,
        args = { 'auto', 'استفاده از جلیقه ضد گلوله و هر نوع موادی به جز ال‌اس‌دی، موقعی که رابری استارت می‌شود، تا پایان رابری ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'رابرها موظفند پس از اتمام فایت، سریعاً محل رابری را ترک کنند'}
    },
    {
        template = 1,
        args = { 'auto', 'هر گونه کل‌کل، رجزخوانی، تمسخر، چت اواوسی، ایموت به منظور تمسخر و... در حین رابری و پس از آن ممنوع است'}
    },
    {
        template = 1,
        args = { 'auto', 'برای خفت‌گیری باید حداقل 1 مدیک آنلاین باشند'}
    },
    {
        template = 1,
        args = { 'auto', 'نباید به منظور خفت‌گیری، اطراف مناطق بارگیری، بسته‌بندی و فروش مواد کمپ کنید، تا هر کسی از آن خارج شد، را خفت کنید'}
    },
    {
        template = 1,
        args = { 'auto', 'در صورتی که کسانی که خفت می‌شوند، از خود دفاع کنند، آرپی از حالت خفت‌گیری خارج می‌شود و به درگیری خیابانی تبدیل می‌شود'}
    },
    {
        template = 1,
        args = { 'auto', ' (خفت گیری در محوطه شهر ممنوع می باشد، اگر خفت گیری از خارج شهر به داخل شهر کشیده شد میتوانید آرپی را ادامه دهید (ایست بازرسی شریف به پایین، بانک ساحلی به پایین محوطه شهری محسوب می شود'}
    },
    {
        template = 1,
        args = { 'auto', "اگر مشکلی در ارگان مواجه شدید میتوانید شکایت خود را در دادگستری ثبت کنید"}
    },
    {
        template = 1,
        args = { 'auto', "اگر با رنک بالاتر از خود به مشکل خوردید میتوانید به دادگستری اطلاع دهید"}
    },
    {
        template = 1,
        args = { 'auto', "اگر مشکلی با شهروندان دارید میتواند جهت ثبت شکایت به دادگستری مراجعه کنید"}
    },
    {
        template = 1,
        args = { 'auto', "ارسال ریپورت در حین ارپی ممنوع میباشد"}
    },
}
local temp = {
    {
        template = '<div style="padding: 0.5vw; margin: 0.5vw; background-color: rgba(54, 171, 213, 0.4); border-radius: 3px;"><i class="far fa-newspaper"></i>Auto Announce:<br>  {1}</div>',
    },
    {
        template = '<div style="padding: 0.5vw; margin: 0.5vw; background-color: rgba(255, 0, 0, 0.4); border-radius: 3px;"><i class="far fa-newspaper"></i>Auto Announce:<br>  {1}</div>',
    },
}
local num = 1
local time = 300

function send()
    local data = announce[num]
    if data and not exports["xsound"]:isPlayerInStreamerMode() then
        TriggerEvent('chat:addMessage', {
            template = temp[data.template].template,
            args = data.args
        })
     end
    num = num + 1
    if num > #announce then
        num = 1
    end
    time = (ESX.GetPlayerData().SelfLevel or 4) * 60
    Citizen.SetTimeout(time * 1000,send)
end

Citizen.SetTimeout(1000,send)
